<hr style="height:5px;border-width:0;color:MediumAquamarine;background-color:MediumAquamarine">

# SP500 Descriptive Analysis Guide


<hr style="height:5px;border-width:0;color:MediumAquamarine;background-color:MediumAquamarine">

## Purpose

> This code will create a visualization that represents daily volatility of sectors within the S&P500 Index. This Notebook is a guide for how to wrangle and format data in a uniform way so it can be replicated by multiple team members for their assigned sectors within the S&P500 Index. Using the high and low price for the day, calculate the difference(volatility) as a percent. Then get the average volatility for the month. Compare the volatility against the other sectors and evaluate for correlation, divergence and which sectors appear to have the most volatility.

# Import Packages

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# Israel Data
Financials = pd.read_csv("../Data/Financials2_JV.csv")

In [3]:
# Jorge Data
Healthcare = pd.read_csv("../Data/Healthcare_JV.csv")

In [4]:
# Jesus Data
IT = pd.read_csv("../Data/IT(1)_JV.csv")

In [5]:
CD = pd.read_csv ("../Data/CD_JV.csv")

# We will all need to meet to work out the details but we are going to try to make the data uniform by selecting the average price on a monthly or yearly basis

In [24]:
Financials.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1258 entries, 0 to 1257
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             1258 non-null   datetime64[ns]
 1   Open             1258 non-null   float64
 2   High             1258 non-null   float64
 3   Low              1258 non-null   float64
 4   Close            1258 non-null   float64
 5   Adj Close        1258 non-null   float64
 6   Volume           1258 non-null   int64
 7   diff_financials  1258 non-null   float64
dtypes: datetime64[ns](1), float64(6), int64(1)
memory usage: 78.8 KB

In [25]:
Healthcare.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 252 entries, 0 to 251
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    252 non-null    datetime64[ns]
 1   Open    252 non-null    object
 2   High    252 non-null    object
 3   Low     252 non-null    object
 4   Close   252 non-null    object
dtypes: datetime64[ns](1), object(4)
memory usage: 10.0+ KB

In [26]:
IT.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1258 entries, 0 to 1257
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       1258 non-null   datetime64[ns]
 1   Open       1258 non-null   float64
 2   High       1258 non-null   float64
 3   Low        1258 non-null   float64
 4   Close      1258 non-null   float64
 5   Adj Close  1258 non-null   float64
 6   Volume     1258 non-null   int64
 7   diff_IT    1258 non-null   float64
dtypes: datetime64[ns](1), float64(6), int64(1)
memory usage: 78.8 KB

In [27]:
CD.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1258 entries, 0 to 1257
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0.1  1258 non-null   int64
 1   Unnamed: 0    1258 non-null   int64
 2   Date          1258 non-null   datetime64[ns]
 3   Open          1258 non-null   object
 4   High          457 non-null    float64
 5   Low           484 non-null    float64
 6   Close*        1258 non-null   object
 7   Adj Close**   1258 non-null   object
 8   Volume        1257 non-null   object
dtypes: datetime64[ns](1), float64(2), int64(2), object(4)
memory usage: 88.6+ KB

### Inspecting the data to see what wrangling needs to be done.

In [6]:
Financials.head()

         Date       Open       High        Low      Close  Adj Close   Volume
0  2018-06-18  69.629997  70.099998  69.330002  70.059998  62.412540   409300
1  2018-06-19  69.379997  70.099998  69.279999  69.940002  62.305649   438000
2  2018-06-20  70.360001  70.449997  69.779999  69.830002  62.207642   427600
3  2018-06-21  69.599998  69.980003  69.150002  69.620003  62.020561  1670900
4  2018-06-22  70.000000  70.099998  69.230003  69.250000  61.690964   300500

In [7]:
Financials.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
1253,2023-06-09,80.180000,80.629997,80.080002,80.239998,80.239998,282600
1254,2023-06-12,80.239998,80.629997,79.639999,80.169998,80.169998,237200
1255,2023-06-13,80.250000,81.139999,80.139999,80.800003,80.800003,268000
1256,2023-06-14,81.000000,81.410004,80.169998,80.470001,80.470001,4293800
1257,2023-06-15,80.089996,81.629997,80.059998,81.489998,81.489998,333900

In [8]:
# We have a good 10 years of data for Financials

In [9]:
IT.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-06-18,137.679993,138.250000,136.699997,137.759995,137.759995,361400
1,2018-06-19,136.720001,137.789993,135.910004,137.199997,137.199997,539800
2,2018-06-20,137.320007,137.699997,136.039993,136.520004,136.520004,522400
3,2018-06-21,136.660004,137.229996,135.380005,135.820007,135.820007,318700
4,2018-06-22,136.080002,137.419998,134.639999,134.960007,134.960007,1090500

In [10]:
IT.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
1253,2023-06-09,344.750000,348.290009,343.429993,344.549988,344.549988,458000
1254,2023-06-12,347.269989,353.779999,345.859985,352.339996,352.339996,414500
1255,2023-06-13,353.799988,357.489990,353.079987,354.850006,354.850006,518800
1256,2023-06-14,353.799988,357.440002,349.970001,352.369995,352.369995,472700
1257,2023-06-15,353.019989,358.149994,353.019989,356.190002,356.190002,529000

In [11]:
# It appears for IT we only have about 1 year of data

In [12]:
Healthcare.head()

        Date      Open      High       Low     Close
0  6/16/2023  1,536.36  1,536.25  1,536.25  1,536.25
1  6/15/2023  1,512.91  1,536.36  1,536.36  1,536.36
2  6/14/2023  1,530.05  1,512.91  1,512.91  1,512.91
3  6/13/2023  1,522.00  1,530.05  1,530.05  1,530.05
4  6/12/2023  1,515.05  1,522.00  1,522.00  1,522.00

In [13]:
Healthcare.tail()

          Date      Open      High       Low     Close
247  6/23/2022  1,450.41  1,482.55  1,482.55  1,482.55
248  6/22/2022  1,430.06  1,450.41  1,450.41  1,450.41
249  6/21/2022  1,393.22  1,430.06  1,430.06  1,430.06
250  6/17/2022  1,392.94  1,393.22  1,393.22  1,393.22
251  6/16/2022  1,414.45  1,392.94  1,392.94  1,392.94

In [14]:
CD.head()

,Unnamed: 0.1,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume
0,0,0,"Jun 16, 2023","1,309.45","1,310.06","1,297.96","1,298.65","1,298.65","610,126,300"
1,1,1,"Jun 15, 2023","1,281.80","1,305.70","1,278.47","1,301.04","1,301.04","494,538,800"
2,2,2,"Jun 14, 2023","1,295.86","1,299.41","1,275.46","1,292.23","1,292.23","508,152,400"
3,3,3,"Jun 13, 2023","1,292.28","1,294.55","1,280.39","1,293.65","1,293.65","494,163,200"
4,4,4,"Jun 12, 2023","1,267.53","1,282.99","1,263.15","1,280.79","1,280.79","535,114,300"

In [15]:
CD.tail()

,Unnamed: 0.1,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume
1253,1253,1253,"Jun 25, 2018",881.99,882.23,862.38,867.52,867.52,-
1254,1254,1254,"Jun 22, 2018",892.64,893.14,886.10,886.81,886.81,-
1255,1255,1255,"Jun 21, 2018",895.70,896.44,886.67,888.02,888.02,-
1256,1256,1256,"Jun 20, 2018",895.18,897.11,891.43,894.32,894.32,-
1257,1257,1257,"Jun 19, 2018",884.54,890.22,881.92,890.09,890.09,NaN

In [16]:
# Here we have a good 5 years of data

## We will plan on creating 12 data points, one for each month since we are limited by the IT dataset. 
> The end goal will be to show the average difference between the High and Low prices on a percentage basis. We will take the average on a monthly bassis from June 2022 to June 2023.These dates are chosen based on what is available in the IT dataset. With this format applied to each dataset we can merge all of the data together and assess correlation and divergence.

# Step 1: Wrangle the data

In [17]:
# Here are the wrangline objectives

# We need the Date in numeric format.

# Create a column showing the difference between High and Low as a percent.

# Create a new df with a '_W' at the end to indicate Wrangling with only necesary columns

# Isolate Date range for June 2022 to June 2023

# Parse the Dates 

# Group the data by month and calculate the mean

# Create visualization for individual dataset

In [20]:
# Converting dates to datetime format

Financials['Date'] = pd.to_datetime(Financials['Date'])
IT['Date'] = pd.to_datetime(IT['Date'])
Healthcare['Date'] = pd.to_datetime(Healthcare['Date'])
CD['Date'] = pd.to_datetime(CD['Date'], format='%b %d, %Y')

### In the Consumer Staples Dataset (Healthcare) the prices are string Dtype. They must be converted to numeric for calculating the difference.

In [22]:
CD['High'] = pd.to_numeric(CD['High'], errors='coerce')
CD['Low'] = pd.to_numeric(CD['Low'], errors='coerce')

In [28]:
Healthcare['High'] = pd.to_numeric(Healthcare['High'], errors='coerce')
Healthcare['Low'] = pd.to_numeric(Healthcare['Low'], errors='coerce')

In [40]:
Healthcare['High'] = pd.to_numeric(Healthcare['High'])
Healthcare['Low'] = pd.to_numeric(Healthcare['Low'])

In [41]:
Healthcare.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 252 entries, 0 to 251
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             252 non-null    datetime64[ns]
 1   Open             252 non-null    object
 2   High             0 non-null      float64
 3   Low              0 non-null      float64
 4   Close            252 non-null    object
 5   diff_Healthcare  0 non-null      float64
dtypes: datetime64[ns](1), float64(3), object(2)
memory usage: 11.9+ KB

In [29]:
# Create Column showing the difference beween the Open and Close price !!!as a percentage!!!
# ** The percent changed is based on the opening price for the session

# All of these columns will eventually be merged so we need to add a suffix to the colunms

Financials['diff_financials'] = ((Financials['High'] - Financials['Low'])/ Financials['Low']) * (100)
IT['diff_IT'] = ((IT['High'] - IT['Low'])/ IT['Low']) * (100)
Healthcare['diff_Healthcare'] = ((Healthcare['High'] - Healthcare['Low'])/ Healthcare['Low']) * (100)
CD['diff_CD'] = ((CD['High'] - CD['Low'])/ CD['Low']) * (100)

### Here we can inspect the changes before moving forward 
> Specifically we are looking at our difference column

> The difference column require a unique ID for the data it represents since we are merging the datasets. The standard naming convention will be 'diff_suffix"

In [30]:
Financials.head()

,Date,Open,High,Low,Close,Adj Close,Volume,diff_financials
0,2018-06-18,69.629997,70.099998,69.330002,70.059998,62.412540,409300,1.110625
1,2018-06-19,69.379997,70.099998,69.279999,69.940002,62.305649,438000,1.183601
2,2018-06-20,70.360001,70.449997,69.779999,69.830002,62.207642,427600,0.960158
3,2018-06-21,69.599998,69.980003,69.150002,69.620003,62.020561,1670900,1.200291
4,2018-06-22,70.000000,70.099998,69.230003,69.250000,61.690964,300500,1.256673

In [31]:
IT.head()

,Date,Open,High,Low,Close,Adj Close,Volume,diff_IT
0,2018-06-18,137.679993,138.250000,136.699997,137.759995,137.759995,361400,1.133872
1,2018-06-19,136.720001,137.789993,135.910004,137.199997,137.199997,539800,1.383260
2,2018-06-20,137.320007,137.699997,136.039993,136.520004,136.520004,522400,1.220232
3,2018-06-21,136.660004,137.229996,135.380005,135.820007,135.820007,318700,1.366517
4,2018-06-22,136.080002,137.419998,134.639999,134.960007,134.960007,1090500,2.064765

In [32]:
Healthcare.head()

        Date      Open  High  Low     Close  diff_Healthcare
0 2023-06-16  1,536.36   NaN  NaN  1,536.25              NaN
1 2023-06-15  1,512.91   NaN  NaN  1,536.36              NaN
2 2023-06-14  1,530.05   NaN  NaN  1,512.91              NaN
3 2023-06-13  1,522.00   NaN  NaN  1,530.05              NaN
4 2023-06-12  1,515.05   NaN  NaN  1,522.00              NaN

In [33]:
CD.head()

,Unnamed: 0.1,Unnamed: 0,Date,Open,High,Low,Close*,Adj Close**,Volume,diff_CD
0,0,0,2023-06-16,"1,309.45",NaN,NaN,"1,298.65","1,298.65","610,126,300",NaN
1,1,1,2023-06-15,"1,281.80",NaN,NaN,"1,301.04","1,301.04","494,538,800",NaN
2,2,2,2023-06-14,"1,295.86",NaN,NaN,"1,292.23","1,292.23","508,152,400",NaN
3,3,3,2023-06-13,"1,292.28",NaN,NaN,"1,293.65","1,293.65","494,163,200",NaN
4,4,4,2023-06-12,"1,267.53",NaN,NaN,"1,280.79","1,280.79","535,114,300",NaN

## Now we are creating our wrangled dataframe with '_W' suffix.
> This dataset will be trimmed down containing only necessary data for the analysis.

In [34]:
Financials_W = Financials[['Date', 'diff_financials']]
IT_W = IT[['Date', 'diff_IT']]
Healthcare_W = Healthcare[['Date','diff_Healthcare']]
CD_W = CD[['Date', 'diff_CD']]

#### Take a look and make sure this is correct

In [35]:
Financials_W.head(2)

        Date  diff_financials
0 2018-06-18         1.110625
1 2018-06-19         1.183601

In [36]:
IT_W.head(2)

        Date   diff_IT
0 2018-06-18  1.133872
1 2018-06-19  1.383260

In [37]:
Healthcare_W.head(2)

        Date  diff_Healthcare
0 2023-06-16              NaN
1 2023-06-15              NaN

In [38]:
CD_W.head(2)

        Date  diff_CD
0 2023-06-16      NaN
1 2023-06-15      NaN

## Trim the data down to only June 2022 to June 2023

In [ ]:
# Assign the start and end dates we want to filter as a variable
start_date = pd.to_datetime('2022-06-01')
end_date = pd.to_datetime('2023-06-30')

In [ ]:
# Use stand and end dates to trim the data for the desired uniform dates. 
Financials_W = Financials_W[(Financials_W['Date'] >= start_date) & (Financials_W['Date'] <= end_date)]

In [ ]:
# Use stand and end dates to trim the data for the desired uniform dates. 
IT_W = IT_W[(IT_W['Date'] >= start_date) & (IT_W['Date'] <= end_date)]

In [ ]:
# Use stand and end dates to trim the data for the desired uniform dates. 
Healthcare_W = Healthcare_W[(Healthcare_W['Date'] >= start_date) & (Healthcare_W['Date'] <= end_date)]

In [ ]:
CD_W = CD_W[(CD_W['Date'] >= start_date) & (CD_W['Date'] <= end_date)]

### Financials- Parse dates, calcuate mean, and generate visualization

In [ ]:
# Extract year and month
Financials_W['year_month'] = Financials_W['Date'].dt.strftime('%Y-%m')

In [ ]:
Financials_W.head(2)

In [ ]:
# Group the data by month and get the mean of the daily percent

Financials_mean = Financials_W.groupby('year_month')['diff_financials'].mean()

In [ ]:
# resetting the index corrects index to maintain column name integrity.
Financials_mean = Financials_mean.reset_index()
Financials_mean.head()

In [ ]:
# Set the 'Year' column as the index

Financials_mean = Financials_mean.reset_index() # resetting the index corrects index to maintain column name integrity.
Financials_mean.set_index('year_month', inplace=True) # set_index assigns the date as the X axis

# Plotting the Inflation Data as a line graph
Financials_mean['diff_financials'].plot() # This assigns the data to be plotted
plt.xlabel('Month/Year')
plt.ylabel('Average Percent Change')
plt.title('Materials Average Daily Price Change(in percent)')
plt.show()

### IT- Parse dates, calcuate mean, and generate visualization

In [ ]:
# Extract year and month
IT_W['year_month'] = IT_W['Date'].dt.strftime('%Y-%m')

In [ ]:
IT_W.head(2)

In [ ]:
# Group the data by month and get the mean of the daily percent

IT_mean = IT_W.groupby('year_month')['diff_IT'].mean()

In [ ]:
# resetting the index corrects index to maintain column name integrity.
IT_mean = IT_mean.reset_index()
IT_mean.head()

In [ ]:
# Set the 'Year' column as the index

IT_mean = IT_mean.reset_index() # resetting the index corrects index to maintain column name integrity.
IT_mean.set_index('year_month', inplace=True) # set_index assigns the date as the X axis

# Plotting the Inflation Data as a line graph
IT_mean['diff_IT'].plot() # This assigns the data to be plotted
plt.xlabel('Month/Year')
plt.ylabel('Average Percent Change')
plt.title('Information Technology Average Daily Price Change(in percent)')
plt.show()

### Healthcare- Parse dates, calcuate mean, and generate visualization

In [ ]:
# Extract year and month
Healthcare_W['year_month'] = Healthcare_W['Date'].dt.strftime('%Y-%m')

In [ ]:
Healthcare_W.head(2)

In [ ]:
# Group the data by month and get the mean of the daily percent

Healthcare_mean = Healthcare_W.groupby('year_month')['diff_Healthcare'].mean()

In [ ]:
# resetting the index corrects index to maintain column name integrity.
Healthcare_mean = Healthcare_mean.reset_index()
Healthcare_mean.head()

In [ ]:
# Set the 'Year' column as the index

Healthcare_mean = Healthcare_mean.reset_index() # resetting the index corrects index to maintain column name integrity.
Healthcare_mean.set_index('year_month', inplace=True) # set_index assigns the date as the X axi

# Plotting the Inflation Data as a line graph
Healthcare_mean['diff_Healthcare'].plot() # This assigns the data to be plotted
plt.xlabel('Month/Year')
plt.ylabel('Average Percent Change')
plt.title('Consumer Staples Average Daily Price Change(in percent)')
plt.show()

### Consumer Discretionary(CD)- Parse dates, calcuate mean, and generate visualization

In [ ]:
# Extract year and month
CD_W['year_month'] = CD_W['Date'].dt.strftime('%Y-%m')

In [ ]:
CD_W.head(2)

In [ ]:
# Group the data by month and get the mean of the daily percent

CD_mean = CD_W.groupby('year_month')['diff_CD'].mean()

In [ ]:
# resetting the index corrects index to maintain column name integrity.
CD_mean = CD_mean.reset_index()
CD_mean.head()

In [ ]:
# Set the 'Year' column as the index

CD_mean = CD_mean.reset_index() # resetting the index corrects index to maintain column name integrity.
CD_mean.set_index('year_month', inplace=True) # set_index assigns the date as the X axi

# Plotting the Inflation Data as a line graph
CD_mean['diff_CD'].plot() # This assigns the data to be plotted
plt.xlabel('Month/Year')
plt.ylabel('Average Percent Change')
plt.title('Consumer Discretionary Average Daily Price Change(in percent)')
plt.show()

# Now we combine the Datasets and put them all in one graph

In [ ]:
# Merge materials data and IT data
all_1 = pd.merge(Financials_mean, IT_mean, on='year_month', suffixes=('_mat', '_IT'))

In [ ]:
# Merge all_1 with Consumer Staples Data
all_2 = pd.merge(all_1, Healthcare_mean, on='year_month',suffixes=('_all_1', '_Healthcare'))

In [ ]:
all_3 = pd.merge(all_2, CD_mean, on='year_month',suffixes=('_all_2', '_CD'))

In [ ]:
all_3.head()

In [ ]:
# Select only necessary columnns for analysis
all_4 = all_3[['diff_financials','diff_IT', 'diff_Healthcare']]

## Notice when all_3 is called without .reset_index() the year_month column is indexed properly with the other column names. 
> If you run all_3.columns 'year_month' will not display as a column name. Running .reset_index() remedies this

In [ ]:

all_4

In [ ]:
all_4.columns

In [ ]:
all_4 = all_4.reset_index()
all_4

# Visualizing the combined data

In [ ]:


# Set the 'Year' column as the index
all_4 = all_4.reset_index()
all_4.set_index('year_month', inplace=True)

# Create the figure and axes
fig, ax1 = plt.subplots()

# Plotting the variables on the primary y-axis
ax1.plot(all_4['diff_financials'], label='Financials')
ax1.plot(all_4['diff_IT'], label='Information Techmology')
ax1.plot(all_4['diff_Healthcare'], label='Healthcare')
ax1.plot(all_4['diff_CD'], label='Consumer Discrationary')

# Set the labels and title for the primary y-axis
ax1.set_xlabel('Month/Year')
ax1.set_ylabel('Percent Change')
ax1.set_title('Average of Daily Volitility by month')

# Rotate x-axis labels by 90 degrees
plt.xticks(rotation=90)


# Display the legend for both y-axes
ax1.legend(loc='upper left') 


# Show the plot
plt.show()